tsung_logs/memcaching/test1.xml
<?xml version="1.0"?><tsung loglevel="info">
    <clients>
        <client host="localhost" use_controller_vm="true" maxusers="1500"/>
    </clients>

    <servers>
        <server host="poolfolio.uzgjd2dkms.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
    </servers>


    <load>
        <arrivalphase phase="1" duration="30" unit="second">
            <users arrivalrate="1" unit="second"/>
        </arrivalphase>
        <arrivalphase phase="2" duration="30" unit="second">
            <users arrivalrate="2" unit="second"/>
        </arrivalphase>
        <arrivalphase phase="3" duration="30" unit="second">
            <users arrivalrate="4" unit="second"/>
        </arrivalphase>
        <arrivalphase phase="4" duration="30" unit="second">
            <users arrivalrate="8" unit="second"/>
        </arrivalphase>
        </load>

    <options>
        <option name="global_ack_timeout" value="2000"/>

        <option type="ts_http" name="user_agent">
            <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511
                Firefox/1.0.4
            </user_agent>
        </option>
    </options>

    <sessions>
        <session name="http-example" probability="100" type="ts_http">

            <request>
                <http url="/" version="1.1" method="GET"/>
            </request>

            <thinktime value="1" random="true"/>

            <request>
                <http url="/users/sign_in" version="1.1" method="GET"/>
            </request>
            <thinktime value="1" random="true"/>
            <request>
                <dyn_variable name="authenticity_token"/>
                <http url="/users/sign_up" version="1.1" method="GET">
                    <http_header name="Cookie" value="%%_cookie%%"/>
                </http>
            </request>

            <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->     {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),     http_uri:encode(Val) end.">
                <var name="encoded_authenticity_token"/>
            </setdynvars>

            <thinktime value="2" random="true"/>

            <setdynvars sourcetype="random_string" length="7">
                <var name="rndstring"/>
            </setdynvars>

            <request subst="true">
                <http url="/users" version="1.1" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;user%5Bfirstname%5D=%%_rndstring%%&amp;user%5Blastname%5D=%%_rndstring%%&amp;user%5Bemail%5D=%%_rndstring%%@gmail.com&amp;user%5Bpassword%5D=%%_rndstring%%&amp;user%5Bpassword_confirmation%5D=%%_rndstring%%&amp;user%5Bteam_id%5D=1&amp;commit=Sign+Up" content_type="application/x-www-form-urlencoded" method="POST">
                </http>
            </request>

            <thinktime value="2" random="true"/>

            <request subst="true">
                <http url="/suggestions/200/like" version="1.1" contents="_method=put&amp;authenticity_token=%%_encoded_authenticity_token%%" content_type="application/x-www-form-urlencoded" method="POST">
                </http>
            </request>

            <thinktime value="2" random="true"/>

            <request subst="true">
                <http url="/suggestions/201/like" version="1.1" contents="_method=put&amp;authenticity_token=%%_encoded_authenticity_token%%" content_type="application/x-www-form-urlencoded" method="POST">
                </http>
            </request>

            <thinktime value="2" random="true"/>

            <request subst="true">
                <http url="/suggestions/209/unlike" version="1.1" contents="_method=put&amp;" content_type="application/x-www-form-urlencoded" method="POST">
                </http>
            </request>

            <thinktime value="2" random="true"/>

            <request subst="true">
                <http url="/suggestions/213/unlike" version="1.1" contents="_method=put&amp;" content_type="application/x-www-form-urlencoded" method="POST">
                </http>
            </request>

            <thinktime value="2" random="true"/>

            <setdynvars sourcetype="random_string" length="7">
                <var name="rndstring2"/>
            </setdynvars>

            <request subst="true">
                <http url="/suggestions" version="1.1" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;suggestion%5Bquantity%5D=500&amp;suggestion%5Bticker%5D=%%_rndstring2%%&amp;commit=Create+Suggestion" content_type="application/x-www-form-urlencoded" method="POST">
                </http>
            </request>

            <thinktime value="2" random="true"/>

            <setdynvars sourcetype="random_string" length="7">
                <var name="rndstring3"/>
            </setdynvars>

            <request subst="true">
                <http url="/suggestions" version="1.1" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;suggestion%5Bquantity%5D=500&amp;suggestion%5Bticker%5D=%%_rndstring3%%&amp;commit=Create+Suggestion" content_type="application/x-www-form-urlencoded" method="POST">
                </http>
            </request>

            <thinktime value="1" random="true"/>

            <request>
                <http url="/teams" version="1.1" method="GET"/>
            </request>

            <request>
                <http url="/teams/1" version="1.1" method="GET"/>
            </request>

            <thinktime value="2" random="true"/>

            <request>
                <http url="/teams/2/join" version="1.1" method="GET"/>
            </request>

            <thinktime value="2" random="true"/>

            <request subst="true">
                <http url="/suggestions/206/like" version="1.1" contents="_method=put&amp;authenticity_token=%%_encoded_authenticity_token%%" content_type="application/x-www-form-urlencoded" method="POST">
                </http>
            </request>

            <thinktime value="2" random="true"/>

            <request subst="true">
                <http url="/suggestions/202/like" version="1.1" contents="_method=put&amp;authenticity_token=%%_encoded_authenticity_token%%" content_type="application/x-www-form-urlencoded" method="POST">
                </http>
            </request>

            <thinktime value="2" random="true"/>

            <request subst="true">
                <http url="/suggestions/210/unlike" version="1.1" contents="_method=put&amp;" content_type="application/x-www-form-urlencoded" method="POST">
                </http>
            </request>

            <thinktime value="2" random="true"/>

            <request subst="true">
                <http url="/suggestions/214/unlike" version="1.1" contents="_method=put&amp;" content_type="application/x-www-form-urlencoded" method="POST">
                </http>
            </request>

            <thinktime value="2" random="true"/>

            <setdynvars sourcetype="random_string" length="7">
                <var name="rndstring4"/>
            </setdynvars>

            <request subst="true">
                <http url="/suggestions" version="1.1" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;suggestion%5Bquantity%5D=500&amp;suggestion%5Bticker%5D=%%_rndstring4%%&amp;commit=Create+Suggestion" content_type="application/x-www-form-urlencoded" method="POST">
                </http>
            </request>

            <thinktime value="2" random="true"/>

            <setdynvars sourcetype="random_string" length="7">
                <var name="rndstring5"/>
            </setdynvars>

            <request subst="true">
                <http url="/suggestions" version="1.1" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;suggestion%5Bquantity%5D=500&amp;suggestion%5Bticker%5D=%%_rndstring5%%&amp;commit=Create+Suggestion" content_type="application/x-www-form-urlencoded" method="POST">
                </http>
            </request>

            <thinktime value="1" random="true"/>

            <request>
                <http url="/teams" version="1.1" method="GET"/>
            </request>

            <request>
                <http url="/teams/2" version="1.1" method="GET"/>
            </request>

            <thinktime value="2" random="true"/>

            <request>
                <http url="/teams/3/join" version="1.1" method="GET"/>
            </request>

            <thinktime value="2" random="true"/>

            <request subst="true">
                <http url="/suggestions/207/like" version="1.1" contents="_method=put&amp;authenticity_token=%%_encoded_authenticity_token%%" content_type="application/x-www-form-urlencoded" method="POST">
                </http>
            </request>

            <thinktime value="2" random="true"/>

            <request subst="true">
                <http url="/suggestions/203/like" version="1.1" contents="_method=put&amp;authenticity_token=%%_encoded_authenticity_token%%" content_type="application/x-www-form-urlencoded" method="POST">
                </http>
            </request>

            <thinktime value="2" random="true"/>

            <request subst="true">
                <http url="/suggestions/211/unlike" version="1.1" contents="_method=put&amp;" content_type="application/x-www-form-urlencoded" method="POST">
                </http>
            </request>

            <thinktime value="2" random="true"/>

            <request subst="true">
                <http url="/suggestions/215/unlike" version="1.1" contents="_method=put&amp;" content_type="application/x-www-form-urlencoded" method="POST">
                </http>
            </request>

            <thinktime value="2" random="true"/>

            <setdynvars sourcetype="random_string" length="7">
                <var name="rndstring4"/>
            </setdynvars>

            <request subst="true">
                <http url="/suggestions" version="1.1" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;suggestion%5Bquantity%5D=500&amp;suggestion%5Bticker%5D=%%_rndstring4%%&amp;commit=Create+Suggestion" content_type="application/x-www-form-urlencoded" method="POST">
                </http>
            </request>

            <thinktime value="2" random="true"/>

            <setdynvars sourcetype="random_string" length="7">
                <var name="rndstring5"/>
            </setdynvars>

            <request subst="true">
                <http url="/suggestions" version="1.1" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;suggestion%5Bquantity%5D=500&amp;suggestion%5Bticker%5D=%%_rndstring5%%&amp;commit=Create+Suggestion" content_type="application/x-www-form-urlencoded" method="POST">
                </http>
            </request>

            <thinktime value="2" random="true"/>

            <setdynvars sourcetype="random_string" length="7">
                <var name="rndstring6"/>
            </setdynvars>

            <request subst="true">
                <http url="/suggestions" version="1.1" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;suggestion%5Bquantity%5D=500&amp;suggestion%5Bticker%5D=%%_rndstring6%%&amp;commit=Create+Suggestion" content_type="application/x-www-form-urlencoded" method="POST">
                </http>
            </request>

            <thinktime value="1" random="true"/>

            <request>
                <http url="/teams" version="1.1" method="GET"/>
            </request>

            <request>
                <http url="/teams/3" version="1.1" method="GET"/>
            </request>

            <thinktime value="2" random="true"/>

            <request>
                <http url="/teams/4/join" version="1.1" method="GET"/>
            </request>

            <thinktime value="2" random="true"/>

            <request subst="true">
                <http url="/suggestions/208/like" version="1.1" contents="_method=put&amp;authenticity_token=%%_encoded_authenticity_token%%" content_type="application/x-www-form-urlencoded" method="POST">
                </http>
            </request>

            <thinktime value="2" random="true"/>

            <request subst="true">
                <http url="/suggestions/204/like" version="1.1" contents="_method=put&amp;authenticity_token=%%_encoded_authenticity_token%%" content_type="application/x-www-form-urlencoded" method="POST">
                </http>
            </request>

            <thinktime value="2" random="true"/>

            <request subst="true">
                <http url="/suggestions/212/unlike" version="1.1" contents="_method=put&amp;" content_type="application/x-www-form-urlencoded" method="POST">
                </http>
            </request>

            <thinktime value="2" random="true"/>

            <request subst="true">
                <http url="/suggestions/216/unlike" version="1.1" contents="_method=put&amp;" content_type="application/x-www-form-urlencoded" method="POST">
                </http>
            </request>

            <thinktime value="2" random="true"/>

            <setdynvars sourcetype="random_string" length="7">
                <var name="rndstring4"/>
            </setdynvars>

            <request subst="true">
                <http url="/suggestions" version="1.1" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;suggestion%5Bquantity%5D=500&amp;suggestion%5Bticker%5D=%%_rndstring4%%&amp;commit=Create+Suggestion" content_type="application/x-www-form-urlencoded" method="POST">
                </http>
            </request>

            <thinktime value="2" random="true"/>

            <setdynvars sourcetype="random_string" length="7">
                <var name="rndstring5"/>
            </setdynvars>

            <request subst="true">
                <http url="/suggestions" version="1.1" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;suggestion%5Bquantity%5D=500&amp;suggestion%5Bticker%5D=%%_rndstring5%%&amp;commit=Create+Suggestion" content_type="application/x-www-form-urlencoded" method="POST">
                </http>
            </request>

            <thinktime value="2" random="true"/>

            <setdynvars sourcetype="random_string" length="7">
                <var name="rndstring6"/>
            </setdynvars>

            <request subst="true">
                <http url="/suggestions" version="1.1" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;suggestion%5Bquantity%5D=500&amp;suggestion%5Bticker%5D=%%_rndstring6%%&amp;commit=Create+Suggestion" content_type="application/x-www-form-urlencoded" method="POST">
                </http>
            </request>

            <thinktime value="1" random="true"/>

            <request>
                <http url="/teams" version="1.1" method="GET"/>
            </request>

            <request>
                <http url="/teams/4" version="1.1" method="GET"/>
            </request>

            <thinktime value="2" random="true"/>

            <request>
                <http url="/teams/5/join" version="1.1" method="GET"/>
            </request>

        </session>
    </sessions>
</tsung>